Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: will never match, as the C<a++> will gobble up all the C<a>'s in the string and won't leave any for the remaining part of the pattern.
es_es: nunca coincidirá, porque el C<a++> devorará todas las C<a> en la cadena y no dejará ninguna para el resto del patrón.

source: perluniprops Index of Unicode Version 6.0.0 properties in Perl
es_es: perluniprops Propiedades de Unicode versión 6.0.0 en Perl

source: Last updated January 12, 2006 @ 2100 UTC
es_es: Última actualización 12 de enero de 2006 @ 2100 UTC

source: The VMS port has been improved.
es_es: La adaptación a VMS ha sido mejorada.

source: Perl's learning curve is therefore shallow (easy to learn) and long (there's a whole lot you can do if you really want).
es_es: Así, la curva de aprendizaje de Perl tiene una pendiente suave (es fácil de aprender) y larga (si desea seguir profundizando, puede aprender a hacer muchas cosas).

source: Use C<defined($pid)> or C<//> to determine whether the open was successful.
es_es: Use C<defined($pid)> o C<//> para determinar cuándo el open se realizó correctamente.

source: integer values _and_ if Perl has been compiled to support those.
es_es: enteros de 64 bits __y__ si Perl ha sido compilado para soportarlos.

source: Be nice.
es_es: Sea amable.

source: =item sysopen FILEHANDLE,FILENAME,MODE X<sysopen>
es_es: =item sysopen IDENTIFICADOR_ARCHIVO,ARCHIVO,MODO X<sysopen>

source: Under Unicode rules, there are a few case-insensitive matches that cross the 255/256 boundary.
es_es: Según las normas Unicode, hay unos pocos casos que cruzan el límite 255/256 de las coincidencias de mayúsculas y minúsculas.

source: Apart from being smaller and possibly faster, there should be no user-detectable changes.
es_es: Además de ser má pequeño y, posiblemente, más rápido, no debería haber cambios detectables por el usuario.

source: In particular, string concatenation happens at compile time between literals that don't do variable substitution.
es_es: En particular, concatenación de cadenas que sucede en tiempo de compilación entre literales que no hacen sustitución de variables.

source: If you don't know what to do with microperl you probably shouldn't.
es_es: Si no sabe qué hacer con microperl probablemente no debería construirlo.

source: $nums[$b] <=> $nums[$a] ||
es_es: $numeros[$b] <=> $numeros[$a] ||

source: Sub-minor version numbers are usually used for changes which do not affect functionality, such as documentation patches.
es_es: Números de versión de menor importancia se utilizan generalmente para los cambios que no afectan a la funcionalidad, tales como los parches en la documentación.

source: Larry Wall <larry@wall.org>, with the help of oodles of other folks.
es_es: Larry Wall <larry@wall.org>, con la ayuda de muchas personas.

source: Returns true on success, otherwise it returns C<undef> and sets C<$!> (errno).
es_es: Devuelve verdadero en éxito; de lo contrario devuelve C<undef> y pone C<$!> (errno).

source: This is a generalization of the old behaviour that tested whether the array contained the scalar.
es_es: Esta es una generalización del comportamiento anterior que ponía a prueba si el array contenía el escalar.

source: C<reverse sort ...> is now optimized to sort in reverse, avoiding the generation of a temporary intermediate list.
es_es: C<reverse sort ...> se ha optimizado para ordenar a la inversa, evitando la generación de una lista temporal intermedia.

source: A new command-line switch, B<-A>, is used to activate assertions, which are declared with the C<assertions> pragma.
es_es: Una nueva opción en la línea de comandos, B<-A>, se utiliza para activar aserciones, que son declaradas con el pragma C<assertions>.

source: As with most other power tools, power comes together with the ability to wreak havoc.
es_es: Al igual que con la mayoría de otras herramientas poderosas, este poder viene junto con la capacidad para causar estragos.

source: if ($a =~ /foo/) { ... } # true if $a contains "foo"
es_es: if ($a =~ /foo/) { ... } # verdadero si $a contiene "foo"

source: This is called a I<backreference>.
es_es: A esto se le llama una I<contrareferencia>.

source: Since C<< <> >> isn't explicitly opened, as a normal filehandle is, an C<eof()> before C<< <> >> has been used will cause C<@ARGV> to be examined to determine if input is available.
es_es: Como C<< <> >> no es explícitamente abierto, como lo sería un identificador de archivo, un C<eof()> antes de que un C<< <> >> sea usado, causará que C<@ARGV> sea examinado para determinar si la entrada está disponible.

source: In list context, returns a (possibly empty) list of filename expansions on the value of EXPR such as the standard Unix shell F</bin/csh> would do.
es_es: En contecto lista, devuelve una (posiblemente vacía) lista de la expansión de nombres de archivo del valor de EXPR como si el shell estandar Unix F</bin/csh> lo hiciera.

source: Note that the meanings don't change, just the "greediness": X<metacharacter> X<greedy> X<greediness> X<?> X<*?> X<+?> X<??> X<{n}?> X<{n,}?> X<{n,m}?>
es_es: Tenga en cuanta que los significados no cambian, solo la "avaricia": X<metacarácter> X<codicia> X<avaricia> X<?> X<*?> X<+?> X<??> X<{n}?> X<{n,}?> X<{n,m}?>

source: close ARGV if eof; # reset $.
es_es: close ARGV if eof; # reinicia $.

source: Between the C<%> and the format letter, you may specify several additional attributes controlling the interpretation of the format.
es_es: Entre el C<%> y la letra de formato, puede especificar varios atributos adicionales controlando la interpretación del formato.

source: This is the Perl 6 "commit pattern" C<< <commit> >> or C<:::>.
es_es: Este es "patrón de acometida" C<< <commit> >> o C<:::> de Perl 6.

source: Perl is free software; you can redistribute it and/or modify it under the terms of either:
es_es: Perl es software libre, puede redistribuirlo y/o modificarlo bajo los términos de:

source: This restriction is due to the wide-spread and remarkably convenient custom of using run-time determined strings as patterns.
es_es: Esta restricción se debe a la muy extendida y muy cómoda costumbre de usar determinadas cadenas, como patrones, en tiempo de ejecución.

source: Larry expects that he'll be certified before Perl is.
es_es: Larry espera obtener la certificación antes que Perl.

source: An INSTALL file should be included, and should contain simple installation instructions.
es_es: Un archivo INSTALL debe ser incluido, y debe contener las más sencillas instrucciones de instalación.

source: In the following sections, these operators are covered in precedence order.
es_es: En las secciones siguientes, estos operadores están descritos en orden de precedencia.

source: Documentation changes only
es_es: Solo cambios en la documentación

source: if ((caller(0))[3] eq 'subname') { ... }
es_es: if ((caller(0))[3] eq 'subnombre') { ... }

source: Transliterates all occurrences of the characters found in the search list with the corresponding character in the replacement list.
es_es: Translitera todas las apariciones de los caracteres que se encuentran en la lista de búsqueda con el carácter correspondiente en la lista de reemplazo.

source: For most projects, this information will probably suffice.
es_es: Sin embargo, es probable que para la mayoría de los proyectos baste con esta información.

source: =head2 Conditions
es_es: =head2 Condiciones

source: Run the command "make install"
es_es: Ejecute el comando "make install"

source: The warning, however, is not serious and can be ignored.
es_es: La advertencia, sin embargo, no es grave y puede ser ignorada.

source: sub unimplemented { ... }
es_es: sub no_implementado { ... }

source: LABEL until (EXPR) BLOCK continue BLOCK
es_es: ETIQUETA until (EXPR) BLOQUE continue BLOQUE

source: $HOST = $host =~ tr/a-z/A-Z/r # chained with s///r =~ s/:/ -p/r;
es_es: $HOST = $host =~ tr/a-z/A-Z/r # encadenado con s///r =~ s/:/ -p/r;

source: @them = @folks[0 ..
es_es: @ellos = @gente[0 ..

source: Subroutine call to a named capture group.
es_es: Llamada de una subrutina con un grupo de captura con nombre.

source: Specify version requirements for other Perl modules in the pre-requisites in your Makefile.PL or Build.PL.
es_es: Especifique los requisitos de versión para otros módulos Perl en los pre-requisitos de su Makefile.PL o Build.PL.

source: Perl applies the format to each integer in turn, then joins the resulting strings with a separator (a dot C<.> by default).
es_es: Perl aplica el formato a cada entero por turno, luego une las cadenas resultantes con un separador (un punto C<.> por defecto).

source: Configure: 1 hour
es_es: Configure: 1 hora

source: A named capture group.
es_es: Un grupo de captura con nombre.

source: See L<perlsub> for examples of using these as indirect filehandles in functions.
es_es: Vea L<perlsub> por ejemplos del uso de estos identificadores indirectos de archivo en funciones.

source: "=" is the ordinary assignment operator.
es_es: "=" es el operador ordinario de asignación.

source: would not have worked, since a pattern match in scalar context will only return true or false, rather than a count of matches.
es_es: no habría funcionado, ya que una expresión regular en contexto escalar sólo devolverá verdadero o falso, en lugar de un recuento de las coincidencias.

# print join " ", @files;
source: print join "\n", @files;
es_es: print join "\n", @archivos;

source: In both last cases, the last expression is evaluated in the context that was applied to the C<given> block.
es_es: En los dos últimos casos, la última expresión se evalúa en el contexto en el que se aplicó al bloque C<given>.

source: I18N::LangTags upgraded to version 0.35
es_es: I18N::LangTags actualizado a la versión 0.35

source: print $mixed[$#mixed]; # last element, prints 1.23
es_es: print $mezcla[$#mezcla]; # último elemento, imprime 1.23 en pantalla

source: (We hope.)
es_es: (Esperamos).

source: perlos2 Perl notes for OS/2
es_es: perlos2 Notas para OS/2

source: It can also be that long doubles and doubles are the same thing:
es_es: También puede ser que los long doubles y doubles sean la misma cosa:

source: You may have an optional comma before the closing parenthesis of a list literal, so that you can say:
es_es: Puede tener una coma opcional, antes del paréntesis de cierre en una lista literal, de modo que puede decir:

source: All other characters are encoded as two or more (up to six) bytes using a complex scheme.
es_es: Todos los demás caracteres se codifican como dos o más bytes (hasta seis) mediante un esquema complejo.

source: outputs
es_es: sale

source: unpack("a3 x2 /A A*", "007: Bond, J.") gives ("Bond, J", ".")
es_es: unpack("a3 x2 /A A*", "007: Bond, J.") da ("Bond, J", ".")

source: C<given> is analogous to the C<switch> keyword in other languages.
es_es: C<given> es análogo a la palabra clave C<switch>, de otros lenguajes.

source: While the general backwards compatibility is maintained, several changes must be noted:
es_es: Mientras que la compatibilidad con versiones anteriores, en general, se mantiene, se deben tenerse en cuenta diversos cambios:

source: See your native chmod(2) and stat(2) documentation for more details about the C<S_*> constants.
es_es: Consulte su documentación de las nativas chmod(2) y stat(2) para obtener más detalles acerca de las constantes C<S_*>.

source: push @INC, [ \&my_sub, $x, $y, ... ];
es_es: push @INC, [ \&mi_sub, $x, $y, ... ];

source: Binary ">>" returns the value of its left argument shifted right by the number of bits specified by the right argument.
es_es: Binario ">>" devuelve el valor de su argumento izquierdo desplazado a la derecha por el número de bits especificado por el argumento de la derecha.

source: This is what C<(.+)+> is doing, and C<(.+)+> is similar to a subpattern of the above pattern.
es_es: Esto es lo que hace C<(.+)+>, y C<(.+)+> es similar a un subpatrón del patrón comentado antes.

source: =item pop ARRAY X<pop> X<stack>
es_es: =item pop ARRAY X<pop> X<stack> X<pila>

# print "$val " while defined($val = pop(@ary));
source: print "$val\n" while defined($val = pop(@ary));
es_es: print "$valor\n" while defined($valor = pop(@ary));

source: ISBN 1-59059-391-X [3rd edition April 2010]
es_es: ISBN 1-59059-391-X [3ª edición - Abril de 2010]

source: The LABEL is optional, and if present, consists of an identifier followed by a colon.
es_es: La ETIQUETA es opcional, y si está presente, consiste en un identificador seguido por el carácter dos puntos.

source: This happens because the pattern match is in list context (since it is being assigned to the empty list), and will therefore return a list of all matching parts of the string.
es_es: Esto sucede porque la expresión regular está en contexto lista (ya que se asigna a la lista vacía), y por lo tanto se obtendrá una lista de todas las coincidencias de la cadena.

source: System calls also set the special C<$!> variable on failure.
es_es: Llamadas al sistema también actualizan la variable especial C<$!> en caso de error.

source: =item default BLOCK
es_es: =item default BLOQUE

source: regular($_) when [ qw/Chris David Ellen/ ];
es_es: normal($_) when [ qw/Chris David Ellen/ ];

source: =item chdir DIRHANDLE
es_es: =item chdir IDENTIFICADOR_DIR

source: Exactly like C:
es_es: Exactamente igual que en C:

source: if (exists $ref->{"Some key"}) { }
es_es: if (exists $ref->{"Alguna clave"}) { }

source: It is now a run-time error to use the smart match operator C<~~> with an object that has no overload defined for it.
es_es: Ahora es un error en tiempo de ejecución usar el operador de coincidencia inteligente C<~~> con un objeto que no tenga la sobrecarga definida para él.

source: You don't have to worry about finding or paying for Perl; it's freely available and several popular operating systems come with Perl.
es_es: No tiene que preocuparse de buscar o pagar por usar Perl; está disponible gratuitamente y varios sistemas operativos populares lo incluyen.

source: If LIMIT is negative, it is treated as if an arbitrarily large LIMIT had been specified.
es_es: Si LÍMITE es negativo, se trata como si se hubiera especificado un LÍMITE arbitrariamente grande.

source: You need an installed and working gccsdk cross compiler L<http://gccsdk.riscos.info/> and REXEN L<http://www.cp15.org/programming/>
es_es: Necesita tener instalado y funcionando un compilador cruzado gccsdk L<http://gccsdk.riscos.info/> y REXEN L<http://www.cp15.org/programming/>

source: To summarise:
es_es: Su funcionamiento se puede resumir de la siguiente manera:

# is %d ",
source: is %d\n",
es_es: es %d\n",

source: The range operator also works on strings, using the magical auto-increment, see below.
es_es: El operador rango también trabaja en las cadenas, usando el auto-incremento mágico, ver abajo.

# print "$key=$value ";
source: print "$key=$value\n";
es_es: print "$clave=$valor\n";

source: or for initializing hash references to be used as records:
es_es: o para inicializar referencias hash para ser utilizados como registros:

source: Setting C<$CGI::TMPDIRECTORY> is now effective
es_es: Ahora funciona la variable C<$CGI::TMPDIRECTORY>

source: Closing the read end of a pipe before the process writing to it at the other end is done writing results in the writer receiving a SIGPIPE.
es_es: Cerrar la lectura final de una tubería antes de que el proceso de escritura en el otro extremo termine resulta en que el escritor recibe un SIGPIPE.

source: perlre Perl regular expressions, the rest of the story
es_es: perlre Expresiones regulares: el resto de la historia

source: (Bugs that have been fixed in 5.8.1)
es_es: (Errores que han sido corregidos en 5.8.1)

source: On systems that support fchmod(2), you may pass filehandles among the files.
es_es: En sistemas que soporten fchmod(2), puede pasar identificadores de archivo entre los archivos.

source: Some of these books are available as free downloads.
es_es: Algunos de estos libros están disponibles como descargas gratuitas:

source: SUBROUTINE can be a bareword, a scalar variable or a subroutine beginning with C<&>.
es_es: SUBRUTINA puede ser una palabra simple, una variable escalar o una subrutina comenzando por C<&>.

source: =head2 Quoting metacharacters
es_es: =head2 Escapando metacaracteres

source: On failure, the C<$REGERROR> variable will be set to the ARG value of the verb pattern, if the verb was involved in the failure of the match.
es_es: En caso de fallo, la variable C<$REGERROR> se establecerá al valor ARG del verbo patrón, si el verbo estaba involucrado en el fallo de la coincidencia.

source: On the other hand, the following:
es_es: Por otra parte, lo siguiente:

source: When used with C<Z>, a C<*> as the repeat count is guaranteed to add a trailing null byte, so the resulting string is always one byte longer than the byte length of the item itself.
es_es: Cuando se utiliza con C<Z>, un C<*> como el número de repeticiones, está garantizado que añadirá un byte nulo final, por lo que la cadena resultante es siempre un byte más largo que la longitud en bytes del propio elemento.

source: Note that the combination C<\\> is left intact, since escaped delimiters are not available for here-docs.
es_es: Tenga en cuenta que la combinación C<\\> se mantiene intacta, ya que no están disponibles delimitadores escapados para los documentos incrustados.

source: For three or more arguments if MODE is C<|->, the filename is interpreted as a command to which output is to be piped, and if MODE is C<-|>, the filename is interpreted as a command that pipes output to us.
es_es: Para tres o más argumentos, cuando MODO es C<|->, el nombre del archivo es interpretado como un comando cuya salida va a ser entubada, y si MODO es <-|>, el nombre del archivo es interpretado como un comando que entuba la salida hacia nosotros.

source: If PID is omitted, returns the process group of the current process.
es_es: Si PID se omite, devuelve el grupo del proceso actual.

source: Certainly they mean two different things on the I<left> side of the C<s///>.
es_es: Significan dos cosas diferentes en el lado I<izquierdo> del C<s///>.

source: The C</x>, C</l>, C</u>, C</a> and C</d> modifiers need a little more explanation.
es_es: Los modificadores C</x>, C</l>, C</u>, C</a> y C</d> necesitan un poco más de explicación.

source: If you are interested in the VM/ESA, z/OS (formerly known as OS/390) and POSIX-BC (BS2000) ports of Perl then see the perl-mvs mailing list.
es_es: Si está interesado en las versiones VM/ESA, z/OS (anteriormente conocido como OS/390) y POSIX-BC (BS2000) de Perl, entonces vea la lista de correo perl-mvs.

source: If the environment variable PERL_DESTRUCT_LEVEL is set to a non-zero value, or if Perl is exiting a spawned thread, it will also destruct the ordinary references and the symbol tables that are no longer in use.
es_es: Si la variable de entorno PERL_DESTRUCT_LEVEL se establece a un valor distinto de cero, o si Perl está saliendo de un hilo, también destruirá las referencias comunes y las tablas de símbolos que ya no están en uso.

source: =head2 Gory details of parsing quoted constructs X<quote, gory details>
es_es: =head2 Detalles sangrientos del análisis de construcciones entrecomilladas X<quote, gory details> X<entrecomillado, detalles sangrientos>

source: Some brief examples:
es_es: Algunos ejemplos breves:

source: For cryptographic purposes, however, you need something much more random than the default seed.
es_es: Para propósitos criptográficos, necesita algo mucho más aleatorio para el valor por defecto de la semilla.

source: Potential problems exist if an extension bypasses the official APIs and directly modifies the PV of an SV: the UTF-8 cache does not get cleared as it should.
es_es: Existen problemas potenciales si una extensión no pasa por la API oficial y modifica directamente el PV de un SV: el caché UTF-8 no es borrado como debiera.

source: In some systems the $comment field may be $class.
es_es: En algunos sistemas el campo $comentario puede ser $clase.

source: C<blib> upgraded to version 1.03
es_es: C<blib> actualizado a la versión 1.03

source: They're discussed in Part 3 of this FAQ, along with CPAN, which is discussed in Part 2.
es_es: Se describen en la parte 3 de este conjunto de documentos sobre preguntas más frecuentes. CPAN se describe en la parte 2.

source: Please don't report bugs in microperl; fix the bugs.
es_es: Por favor, no informe de errores en microperl; corrija los errores.

source: At the end of all C<when> blocks, there is an implicit C<next>.
es_es: Al final de todos los bloques C<when>, hay un implícito C<next>.

source: =head2 Perl Glossary
es_es: =head2 Glosario Perl

source: If LAYER is omitted or specified as C<:raw> the filehandle is made suitable for passing binary data.
es_es: Si se omite CAPA o se especifica como C<:raw> el identificador se prepara para pasar datos binarios.

source: SUPER-UX: add hints file
es_es: SUPER-UX: añadido archivo de sugerencias

source: print $x; # prints "foo"
es_es: print $x; # imprime "foo" en pantalla

source: =item rindex STR,SUBSTR
es_es: =item rindex CADENA,SUBCADENA

source: Returns a non-empty string if EXPR is a reference, the empty string otherwise.
es_es: Devuelve una cadena no vacía si EXPR es una referencia; de otra manera, devuelve una cadena vacía.

source: The build process on both VMS and Windows has had several minor improvements made.
es_es: El proceso de compilación, tanto en VMS como en Windows han tenido pequeñas mejoras.

source: That might mean that Perl either saves them something (time, headaches, money) or gives them something (flexibility, power, testability).
es_es: Esta ayuda puede implicar un ahorro (de tiempo, dinero o dolores de cabeza) o una aportación (en forma de flexibilidad, eficacia o facilidad para realizar pruebas).

source: @sortedclass = sort byage @class;
es_es: @claseordenada = sort por_edad @clase;

source: If it does guess wrong, or if you're just plain paranoid, you can force the correct interpretation with curly braces as above.
es_es: Si se equivoca, o si es usted un sencillo paranoico, puede forzar la interpretación correcta con llaves, como en el caso anterior.

source: Fixed various memory leaks
es_es: Arregladas varias pérdidas de memoria

source: $#days # the last index of array @days
es_es: $#dias # el último índice del array @dias

source: %hash = map { lc($_) => 1 } @array # as does this.
es_es: %hash = map { lc($_) => 1 } @array # y como esto.

source: This is an internal function used by C<format>s, though you may call it, too.
es_es: Esta es una función interna usada por C<format>, aunque también puede llamarla.

source: List values are denoted by separating individual values by commas (and enclosing the list in parentheses where precedence requires it):
es_es: Lista de valores se indican mediante la separación de los valores individuales por comas (y encerrando la lista entre paréntesis donde la precedencia lo requiera):

source: However, since I am running a very recent Hurd snapshot, in which a lot of bugs that were exposed by the Perl test suite have been fixed, you may encounter more failures.
es_es: Sin embargo, como estoy ejecutando una instantánea muy reciente de Hurd, en la que se han corregido muchos de los errores expuestos por el conjunto de pruebas de Perl, es posible que otros usuarios encuentren más errores.

source: Address-of operator.
es_es: Operador Dirección-de.

source: The B<-w> switch is not mandatory.
es_es: El uso del modificador B<-w> no es obligatorio.

source: s/([^ ]*) *([^ ]*)/$2 $1/; # reverse 1st two fields
es_es: s/([^ ]*) *([^ ]*)/$2 $1/; # invierte los dos primeros campos

source: perlport Perl portability guide
es_es: perlport Guía de portabilidad

source: Same as C<tr///>.
es_es: Igual que C<tr///>.
